WB/src/Enums/СтатусыПоставки/СтатусыПоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПоставки</name>
  <enumValues>
    <name>НеЗапланировано</name>
  </enumValues>
  <enumValues>
    <name>Запланировано</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаРазрешена</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженоНаВоротах</name>
  </enumValues>
  <enumValues>
    <name>ИдетПриемка</name>
  </enumValues>
  <enumValues>
    <name>Принято</name>
  </enumValues>
</mdclass:Enum>

WB/src/Enums/СтатусыПоставки/ManagerModule.bsl
Функция ПолучитьПоИд(Ид) Экспорт

	Если Ид = 1 Тогда
		Возврат НеЗапланировано;
	ИначеЕсли Ид = 2 Тогда
		Возврат Запланировано;
	ИначеЕсли Ид = 3 Тогда
		Возврат ОтгрузкаРазрешена;
	ИначеЕсли Ид = 4 Тогда
		Возврат ИдетПриемка;
	ИначеЕсли Ид = 5 Тогда
		Возврат Принято;
	ИначеЕсли Ид = 6 Тогда
		Возврат ОтгруженоНаВоротах;
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции
